[
  {
    "disciplina": "Inglês",
    "trimestre": "2º Trimestre B",
    "bncc": [
      {
        "codigo": "EF05LI09",
        "descricao": "Conhecer a(s) história(s) da língua inglesa no mundo."
      },
      {
        "codigo": "EF05LI12",
        "descricao": "Produzir textos orais e escritos sobre si mesmo, sua família, seus amigos, gostos, preferências e rotinas, sua comunidade e seu contexto escolar."
      },
      {
        "codigo": "EF05LI15",
        "descricao": "Investigar o alcance da língua inglesa no mundo: como língua materna e/ou oficial."
      }
    ],
    "atividades": [
      {
        "id": 1,
        "titulo": "English Around the World",
        "tipo": "quiz",
        "descricao": "Learn about the English language and its presence around the world.",
        "questoes": [
          {
            "pergunta": "In how many countries is English the official or one of the official languages?",
            "opcoes": [
              "Only in England",
              "In about 10 countries",
              "In more than 50 countries",
              "In all countries of the world"
            ],
            "resposta_correta": 2,
            "explicacao": "O inglês é língua oficial ou uma das línguas oficiais em mais de 50 países ao redor do mundo, incluindo Reino Unido, Estados Unidos, Canadá, Austrália, Nova Zelândia, África do Sul, Índia, entre outros."
          },
          {
            "pergunta": "Why is English considered a global language?",
            "opcoes": [
              "Because it's the easiest language to learn",
              "Because it's used for international communication in areas like business, science, technology, and entertainment",
              "Because everyone in the world speaks English",
              "Because it's the oldest language in the world"
            ],
            "resposta_correta": 1,
            "explicacao": "O inglês é considerado uma língua global porque é amplamente utilizado para comunicação internacional em áreas como negócios, ciência, tecnologia, aviação, diplomacia e entretenimento, mesmo entre pessoas que não têm o inglês como língua materna."
          }
        ]
      },
      {
        "id": 2,
        "titulo": "Talking About Yourself",
        "tipo": "quiz",
        "descricao": "Practice writing and speaking about yourself, your family, and your preferences.",
        "questoes": [
          {
            "pergunta": "Complete the text with appropriate information: 'My name is _____. I am _____ years old. I live in _____.'",
            "opcoes": [
              "name / age / city",
              "boy / student / Brazil",
              "student / school / teacher",
              "friend / happy / sad"
            ],
            "resposta_correta": 0,
            "explicacao": "Para completar a apresentação pessoal, precisamos usar: nome (name), idade (age) e cidade onde mora (city). Exemplo: 'My name is Maria. I am 10 years old. I live in São Paulo.'"
          },
          {
            "pergunta": "Which sentence correctly describes a preference?",
            "opcoes": [
              "I have a sister.",
              "I go to school by bus.",
              "I like to play soccer.",
              "I am a student."
            ],
            "resposta_correta": 2,
            "explicacao": "A frase 'I like to play soccer' (Eu gosto de jogar futebol) expressa uma preferência pessoal usando o verbo 'like' (gostar). As outras frases descrevem fatos ou situações, mas não preferências."
          }
        ]
      },
      {
        "id": 3,
        "titulo": "English-Speaking Countries",
        "tipo": "interativo",
        "descricao": "Explore countries where English is spoken around the world.",
        "instrucoes": "Match each country with its flag and one interesting fact about English in that country.",
        "paises": [
          {
            "nome": "United Kingdom",
            "fato": "Birthplace of the English language"
          },
          {
            "nome": "United States",
            "fato": "Has many different regional accents and dialects"
          },
          {
            "nome": "Australia",
            "fato": "Has unique English words like 'g'day' and 'barbie'"
          },
          {
            "nome": "Canada",
            "fato": "English and French are both official languages"
          },
          {
            "nome": "India",
            "fato": "Has the second-largest English-speaking population in the world"
          },
          {
            "nome": "South Africa",
            "fato": "Has 11 official languages, including English"
          }
        ],
        "dica": "Look at the map to see where each country is located and think about what makes English unique in each place."
      },
      {
        "id": 4,
        "titulo": "My Daily Routine",
        "tipo": "desafio",
        "descricao": "Write about your daily routine in English.",
        "questoes": [
          {
            "pergunta": "Write 5 sentences describing your daily routine using the present simple tense. Include activities you do in the morning, afternoon, and evening.",
            "resposta": "Example: I wake up at 6:30 in the morning. I have breakfast with my family. I go to school by bus. I do my homework in the afternoon. I watch TV before going to bed.",
            "dica": "Use verbs in the present simple tense (wake up, have, go, do, watch) and time expressions (in the morning, in the afternoon, at night)."
          },
          {
            "pergunta": "Create a short dialogue between two friends talking about their favorite activities. Use at least 6 lines of dialogue.",
            "resposta": "Example:\nAna: Hi João! What do you like to do on weekends?\nJoão: Hi Ana! I like to play video games and watch movies. What about you?\nAna: I prefer to read books and ride my bike in the park.\nJoão: That sounds fun! Do you want to go to the park this Saturday?\nAna: Yes, I'd love to! What time?\nJoão: How about 3 o'clock in the afternoon?",
            "dica": "Include greetings, questions about preferences, and responses. Use expressions like 'I like to...', 'I prefer to...', 'What about you?'"
          }
        ]
      }
    ]
  }
]