{
  "disciplina": "Geografia",
  "trimestre": "2º Trimestre A",
  "bncc": [
    {
      "codigo": "EF05GE01",
      "descricao": "Descrever e analisar dinâmicas populacionais na Unidade da Federação em que vive, estabelecendo relações entre migrações e condições de infraestrutura."
    },
    {
      "codigo": "EF05GE03",
      "descricao": "Identificar as formas e funções das cidades e analisar as mudanças sociais, econômicas e ambientais provocadas pelo seu crescimento."
    },
    {
      "codigo": "EF05GE08",
      "descricao": "Analisar transformações de paisagens nas cidades, comparando sequência de fotografias, fotografias aéreas e imagens de satélite de épocas diferentes."
    },
    {
      "codigo": "EF05GE02",
      "descricao": "Identificar diferenças étnico-raciais e étnico-culturais e desigualdades sociais entre grupos em diferentes territórios."
    }
  ],
  "atividades": [
    {
      "id": 1,
      "titulo": "Regiões do Brasil",
      "tipo": "quiz",
      "descricao": "Teste seus conhecimentos sobre as regiões brasileiras.",
      "questoes": [
        {
          "pergunta": "Quais estados compõem a região Sudeste do Brasil?",
          "opcoes": [
            "Rio de Janeiro, São Paulo, Minas Gerais e Espírito Santo",
            "Rio de Janeiro, São Paulo, Paraná e Santa Catarina",
            "Minas Gerais, Bahia, Espírito Santo e Rio de Janeiro",
            "São Paulo, Minas Gerais, Goiás e Mato Grosso"
          ],
          "resposta_correta": 0,
          "explicacao": "A região Sudeste é composta pelos estados de Rio de Janeiro, São Paulo, Minas Gerais e Espírito Santo. É a região mais populosa e economicamente desenvolvida do Brasil."
        },
        {
          "pergunta": "Qual região brasileira possui a maior área territorial?",
          "opcoes": [
            "Sudeste",
            "Nordeste",
            "Sul",
            "Norte"
          ],
          "resposta_correta": 3,
          "explicacao": "A região Norte é a maior em área territorial, ocupando aproximadamente 45% do território brasileiro. Ela abrange sete estados: Acre, Amapá, Amazonas, Pará, Rondônia, Roraima e Tocantins."
        }
      ]
    },
    {
      "id": 2,
      "titulo": "Urbanização e Cidades",
      "tipo": "quiz",
      "descricao": "Responda às questões sobre urbanização e crescimento das cidades.",
      "questoes": [
        {
          "pergunta": "O que é êxodo rural?",
          "opcoes": [
            "Movimento de pessoas das cidades para o campo",
            "Movimento de pessoas do campo para as cidades",
            "Movimento de pessoas entre diferentes cidades",
            "Movimento de pessoas entre diferentes países"
          ],
          "resposta_correta": 1,
          "explicacao": "Êxodo rural é o movimento migratório de pessoas que saem do campo (áreas rurais) em direção às cidades (áreas urbanas). No Brasil, esse fenômeno intensificou-se a partir da década de 1950, com a industrialização."
        },
        {
          "pergunta": "Quais são os principais problemas enfrentados pelas grandes cidades brasileiras devido ao crescimento desordenado?",
          "opcoes": [
            "Apenas falta de escolas e hospitais",
            "Apenas poluição do ar e sonora",
            "Apenas violência e desemprego",
            "Falta de moradia adequada, saneamento básico precário, congestionamentos, poluição e violência"
          ],
          "resposta_correta": 3,
          "explicacao": "O crescimento desordenado das cidades brasileiras gerou diversos problemas urbanos, como falta de moradia adequada, saneamento básico precário, congestionamentos, poluição (do ar, sonora, visual e dos recursos hídricos) e aumento da violência."
        }
      ]
    },
    {
      "id": 3,
      "titulo": "Mapa Interativo do Brasil",
      "tipo": "interativo",
      "descricao": "Localize estados e capitais no mapa do Brasil.",
      "instrucoes": "Arraste o nome de cada estado ou capital para sua localização correta no mapa.",
      "itens": [
        {"nome": "São Paulo", "tipo": "estado"},
        {"nome": "Rio de Janeiro", "tipo": "estado"},
        {"nome": "Minas Gerais", "tipo": "estado"},
        {"nome": "Bahia", "tipo": "estado"},
        {"nome": "Brasília", "tipo": "capital"},
        {"nome": "São Paulo", "tipo": "capital"},
        {"nome": "Rio de Janeiro", "tipo": "capital"},
        {"nome": "Salvador", "tipo": "capital"}
      ],
      "dica": "Observe a posição relativa dos estados: São Paulo fica ao sul de Minas Gerais e a leste do Paraná."
    },
    {
      "id": 4,
      "titulo": "Transformações na Paisagem",
      "tipo": "desafio",
      "descricao": "Analise as transformações nas paisagens urbanas e rurais ao longo do tempo.",
      "questoes": [
        {
          "pergunta": "Compare as imagens de uma área urbana em 1980 e em 2020. Quais as principais transformações que você observa?",
          "resposta": "As principais transformações observadas são: aumento no número de edifícios altos, redução de áreas verdes, expansão da área urbana, aumento da malha viária, surgimento de shopping centers e condomínios fechados.",
          "dica": "Observe mudanças na verticalização, áreas verdes e infraestrutura."
        },
        {
          "pergunta": "Quais são os impactos ambientais causados pela expansão urbana desordenada?",
          "opcoes": [
            "Apenas desmatamento",
            "Apenas poluição dos rios",
            "Apenas aumento da temperatura",
            "Desmatamento, impermeabilização do solo, poluição dos rios, formação de ilhas de calor e aumento de enchentes"
          ],
          "resposta_correta": 3,
          "explicacao": "A expansão urbana desordenada causa diversos impactos ambientais, como desmatamento, impermeabilização do solo (que dificulta a absorção da água da chuva), poluição dos rios e córregos, formação de ilhas de calor (aumento da temperatura nas áreas urbanas) e aumento da ocorrência de enchentes."
        }
      ]
    },
    {
      "id": 5,
      "titulo": "População Brasileira",
      "tipo": "quiz",
      "descricao": "Teste seus conhecimentos sobre a distribuição da população brasileira.",
      "questoes": [
        {
          "pergunta": "Algumas áreas do país são muito ocupadas, mas também existem áreas de ocupação muito densa. Indique motivos que expliquem essas áreas mais vazias e as áreas mais cheias.",
          "resposta": "Áreas cheias têm melhor infraestrutura, clima favorável, oportunidades de trabalho; áreas vazias têm difícil acesso, clima hostil, menos oportunidades.",
          "dica": "Pense em fatores como clima, infraestrutura, oportunidades econômicas e acesso a recursos."
        },
        {
          "pergunta": "Diferencie população absoluta e população relativa.",
          "opcoes": [
            "População absoluta é o número de pessoas nascidas em um país; população relativa é o número de imigrantes",
            "População absoluta é o número total de pessoas em um lugar; população relativa é a quantidade de pessoas dividida pela área (densidade demográfica)",
            "População absoluta é o número de adultos; população relativa é o número de crianças",
            "População absoluta é o número de pessoas nas cidades; população relativa é o número de pessoas no campo"
          ],
          "resposta_correta": 1,
          "explicacao": "População absoluta é o número total de habitantes de um lugar, enquanto população relativa (ou densidade demográfica) é a relação entre o número de habitantes e a área ocupada."
        },
        {
          "pergunta": "O que é densidade demográfica e como ela é calculada?",
          "opcoes": [
            "É o número total de habitantes de um país, calculado pelo censo",
            "É a relação entre o número de habitantes e a área ocupada, calculada dividindo a população absoluta pela área territorial",
            "É o crescimento populacional anual, calculado pela diferença entre nascimentos e mortes",
            "É a distribuição da população por faixa etária, calculada pela porcentagem de cada grupo"
          ],
          "resposta_correta": 1,
          "explicacao": "Densidade demográfica é a relação entre o número de habitantes e a área ocupada. Calcula-se dividindo a população absoluta (número total de habitantes) pela área territorial (em km²)."
        }
      ]
    },
    {
      "id": 6,
      "titulo": "Crescimento Populacional",
      "tipo": "quiz",
      "descricao": "Responda às questões sobre o crescimento da população mundial e brasileira.",
      "questoes": [
        {
          "pergunta": "Nos séculos XX e XXI a população do planeta aumentou significativamente, e agora estamos na marca dos 8 bilhões de habitantes na Terra. Quais motivos explicam esse crescimento?",
          "opcoes": [
            "Apenas o aumento da taxa de natalidade",
            "Apenas a diminuição das guerras mundiais",
            "Avanços tecnológicos, melhorias na saúde, aumento da expectativa de vida, melhores condições de vida",
            "Apenas a melhoria na produção de alimentos"
          ],
          "resposta_correta": 2,
          "explicacao": "O crescimento populacional significativo nos séculos XX e XXI deve-se a uma combinação de fatores: avanços tecnológicos, melhorias na saúde pública e medicina (vacinas, antibióticos), aumento da expectativa de vida, melhores condições de saneamento e acesso a água potável, além de melhores condições de vida em geral."
        },
        {
          "pergunta": "O crescimento vegetativo pode ser analisado por meio de alguns indicadores, como a taxa de natalidade e a taxa de mortalidade. Explique o que são esses indicadores.",
          "opcoes": [
            "Taxa de natalidade é o número de nascimentos em um período; taxa de mortalidade é o número de óbitos",
            "Taxa de natalidade é o número de crianças; taxa de mortalidade é o número de idosos",
            "Taxa de natalidade é o número de mulheres; taxa de mortalidade é o número de homens",
            "Taxa de natalidade é o número de casamentos; taxa de mortalidade é o número de divórcios"
          ],
          "resposta_correta": 0,
          "explicacao": "Taxa de natalidade é o número de nascimentos em determinado período (geralmente um ano) para cada mil habitantes. Taxa de mortalidade é o número de óbitos no mesmo período para cada mil habitantes."
        },
        {
          "pergunta": "O que o crescimento natural leva em consideração?",
          "opcoes": [
            "Apenas imigração e emigração",
            "Apenas nascimentos e mortes (taxa de natalidade e mortalidade)",
            "Apenas casamentos e divórcios",
            "Apenas o número de jovens e idosos"
          ],
          "resposta_correta": 1,
          "explicacao": "O crescimento natural ou vegetativo leva em consideração apenas nascimentos e mortes, ou seja, a diferença entre a taxa de natalidade e a taxa de mortalidade, sem considerar migrações."
        }
      ]
    },
    {
      "id": 7,
      "titulo": "IBGE e Censo Demográfico",
      "tipo": "quiz",
      "descricao": "Teste seus conhecimentos sobre o IBGE e o Censo Demográfico brasileiro.",
      "questoes": [
        {
          "pergunta": "O que significa a sigla IBGE?",
          "opcoes": [
            "Instituto Brasileiro de Geografia e Estatística",
            "Instituto Brasileiro de Gestão Econômica",
            "Índice Brasileiro de Gestão Empresarial",
            "Instituto Brasileiro de Governança Estatal"
          ],
          "resposta_correta": 0,
          "explicacao": "IBGE significa Instituto Brasileiro de Geografia e Estatística. É o órgão responsável pela coleta e análise de dados estatísticos sobre a população, economia, geografia e outros aspectos do Brasil."
        },
        {
          "pergunta": "Qual a importância do IBGE?",
          "opcoes": [
            "Apenas para registrar nascimentos e mortes",
            "Apenas para controlar a imigração",
            "Fornece informações estatísticas do Brasil, como número de habitantes, ajudando no planejamento do país",
            "Apenas para cobrar impostos"
          ],
          "resposta_correta": 2,
          "explicacao": "O IBGE é fundamental pois fornece informações estatísticas oficiais sobre o Brasil, incluindo dados demográficos, econômicos, sociais e geográficos. Essas informações são essenciais para o planejamento de políticas públicas, distribuição de recursos, pesquisas acadêmicas e decisões empresariais."
        },
        {
          "pergunta": "Sobre o Censo Demográfico, marque a alternativa CORRETA:",
          "opcoes": [
            "Censo Demográfico é a taxa de natalidade",
            "O Censo Demográfico ocorre de 10 em 10 anos",
            "Por conta do alto custo de vida temos crescimento de habitantes",
            "O Censo conta apenas a população urbana"
          ],
          "resposta_correta": 1,
          "explicacao": "O Censo Demográfico é a contagem oficial da população de um país, realizada periodicamente. No Brasil, ele ocorre a cada 10 anos, sendo conduzido pelo IBGE. O Censo coleta informações detalhadas sobre toda a população, tanto urbana quanto rural."
        }
      ]
    },
    {
      "id": 8,
      "titulo": "Migrações",
      "tipo": "quiz",
      "descricao": "Responda às questões sobre movimentos migratórios.",
      "questoes": [
        {
          "pergunta": "Diferencie emigração e imigração.",
          "opcoes": [
            "Emigração é sair de um lugar; imigração é chegar a um lugar",
            "Emigração é ir para outro país; imigração é mudar de cidade",
            "Emigração é movimento temporário; imigração é movimento definitivo",
            "Emigração é movimento forçado; imigração é movimento voluntário"
          ],
          "resposta_correta": 0,
          "explicacao": "Emigração é o ato de sair, de deixar um lugar (país, região, cidade) para viver em outro. Imigração é o ato de entrar, de chegar a um lugar para nele viver. A mesma pessoa é emigrante em relação ao lugar que deixa e imigrante em relação ao lugar onde chega."
        },
        {
          "pergunta": "Classifique os seguintes fatores como Repulsivos (R) ou Atrativos (A):",
          "opcoes": [
            "Violência urbana (R), Escassez de água (R), Governos democráticos (A)",
            "Violência urbana (A), Escassez de água (A), Governos democráticos (R)",
            "Violência urbana (R), Escassez de água (A), Governos democráticos (R)",
            "Violência urbana (A), Escassez de água (R), Governos democráticos (A)"
          ],
          "resposta_correta": 0,
          "explicacao": "Fatores repulsivos são aqueles que motivam as pessoas a saírem de um lugar, como violência urbana e escassez de água. Fatores atrativos são aqueles que atraem as pessoas para um lugar, como governos democráticos, empregos disponíveis e escolas de qualidade."
        },
        {
          "pergunta": "Qual a diferença entre movimento migratório interno e internacional?",
          "opcoes": [
            "Interno ocorre dentro de um mesmo país; internacional ocorre entre países diferentes",
            "Interno ocorre entre cidades; internacional ocorre entre estados",
            "Interno é temporário; internacional é definitivo",
            "Interno é voluntário; internacional é forçado"
          ],
          "resposta_correta": 0,
          "explicacao": "Movimento migratório interno é aquele que ocorre dentro dos limites de um mesmo país, como a migração do Nordeste para o Sudeste do Brasil. Movimento migratório internacional é aquele que ocorre entre países diferentes, como brasileiros que vão morar em Portugal."
        }
      ]
    },
    {
      "id": 9,
      "titulo": "Diversidade Étnico-racial Brasileira",
      "tipo": "quiz",
      "descricao": "Teste seus conhecimentos sobre a diversidade étnico-racial da população brasileira.",
      "questoes": [
        {
          "pergunta": "Qual é uma das características mais importantes da população brasileira?",
          "opcoes": [
            "Homogeneidade étnica",
            "Miscigenação (mistura de etnias)",
            "Isolamento cultural",
            "Uniformidade linguística"
          ],
          "resposta_correta": 1,
          "explicacao": "A miscigenação, ou seja, a mistura de diferentes etnias e raças, é uma das características mais importantes da população brasileira. O Brasil é um país formado pela contribuição de diversos povos: indígenas, europeus (principalmente portugueses), africanos e, posteriormente, asiáticos e outros imigrantes."
        },
        {
          "pergunta": "Explique o que é o processo de miscigenação étnico-racial.",
          "opcoes": [
            "É a separação de diferentes grupos étnicos",
            "É a mistura de diferentes etnias e raças",
            "É a classificação das pessoas por cor de pele",
            "É a migração entre diferentes regiões"
          ],
          "resposta_correta": 1,
          "explicacao": "O processo de miscigenação étnico-racial refere-se à mistura biológica e cultural entre diferentes grupos étnicos e raciais. No Brasil, esse processo ocorreu principalmente entre indígenas, europeus e africanos, resultando na diversidade étnico-racial que caracteriza a população brasileira atual."
        },
        {
          "pergunta": "Como é definida a etnia do cidadão brasileiro segundo o IBGE?",
          "opcoes": [
            "Pelo exame de DNA",
            "Pela cor da pele determinada por um funcionário do IBGE",
            "Pelo Princípio da Autoafirmação, onde o próprio cidadão determina qual sua etnia",
            "Pelo local de nascimento"
          ],
          "resposta_correta": 2,
          "explicacao": "No Brasil, a etnia do cidadão é definida pelo Princípio da Autoafirmação, o que significa que o próprio cidadão determina a qual grupo étnico-racial pertence, sem necessidade de comprovação ou validação externa."
        }
      ]
    },
    {
      "id": 10,
      "titulo": "Formação da População Brasileira",
      "tipo": "quiz",
      "descricao": "Responda às questões sobre a formação histórica da população brasileira.",
      "questoes": [
        {
          "pergunta": "Quais foram as consequências para os indígenas do contato com a população branca europeia?",
          "opcoes": [
            "Apenas benefícios tecnológicos",
            "Mudança de cultura, diminuição da população, perda de terras, doenças",
            "Apenas enriquecimento cultural",
            "Não houve consequências significativas"
          ],
          "resposta_correta": 1,
          "explicacao": "O contato dos indígenas com os europeus resultou em consequências devastadoras: mudanças forçadas em sua cultura e modo de vida, drástica diminuição populacional devido a doenças para as quais não tinham imunidade, perda de terras tradicionais, escravização e, em muitos casos, genocídio."
        },
        {
          "pergunta": "Podemos afirmar que houve uma diáspora africana tendo o Brasil como destino? Justifique sua resposta.",
          "opcoes": [
            "Não, pois os africanos vieram voluntariamente",
            "Não, pois foram poucos africanos que vieram ao Brasil",
            "Sim, pois milhões de africanos foram trazidos à força para o Brasil como escravizados",
            "Sim, mas apenas no século XX"
          ],
          "resposta_correta": 2,
          "explicacao": "Sim, houve uma diáspora africana tendo o Brasil como destino, pois milhões de africanos foram trazidos à força para o Brasil como escravizados durante o período colonial e imperial. O Brasil foi o país que mais recebeu africanos escravizados nas Américas, o que teve profundo impacto na formação étnica, cultural e social do país."
        },
        {
          "pergunta": "O que os portugueses buscavam quando chegaram ao Brasil? Esse interesse português ajudou o Brasil a se desenvolver?",
          "resposta": "Os portugueses buscavam riquezas, especialmente metais preciosos e produtos comercializáveis na Europa. O interesse português trouxe certo desenvolvimento em termos de infraestrutura e urbanização, mas também resultou em séculos de exploração predatória dos recursos naturais e humanos, escravidão e desigualdades sociais que persistem até hoje.",
          "dica": "Pense nos objetivos econômicos da colonização e nas consequências de longo prazo para o desenvolvimento do país."
        }
      ]
    }
  ]
}
